trade_exp/src/InformationRegisters/ПроцентНаценкиРозница/ПроцентНаценкиРозница.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="aba14641-6aa7-40fc-94cc-399b84cd7c1f">
  <name>ПроцентНаценкиРозница</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="5f1bc3e1-3ba5-4efa-9f2a-db16be597d91">
    <name>ПроцентНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="4c9abfff-72bc-49c9-9c91-85965490a54b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8dc51270-4a5c-4ba1-9e45-ce92bde7b517">
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="1ba35311-fbc3-4ed1-bcb4-b544e2ec53bc">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="f42f2ac0-a522-41d7-9359-717a9b991783">
    <name>ЦеноваяГруппа_Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b18e0fd0-671b-4a03-a82f-1e45a46ba48a">
    <name>Начало</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="66dde80c-8967-454c-a470-dda3fbd5fc46">
    <name>Окончание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ПроцентНаценкиРозница/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрТипЗаписи=0;
	Если Параметры.Свойство("ТипЗаписи", ПараметрТипЗаписи) Тогда
		Если Запись.ТипЗаписи <> ПараметрТипЗаписи Тогда
			Запись.ТипЗаписи=ПараметрТипЗаписи;
		КонецЕсли;
	КонецЕсли;
	Элементы.ЦеноваяГруппа_Номенклатура.Заголовок=?(Запись.ТипЗаписи = 1, "Ценовая группа", "Номенклатура");
	Массив = Новый Массив;
	Если Запись.ТипЗаписи = 1 Тогда
		Массив.Добавить(Тип("СправочникСсылка.ЦеновыеГруппы"));
	Иначе
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	КонецЕсли;
	НашеОписание = Новый ОписаниеТипов(Массив);
	Элементы.ЦеноваяГруппа_Номенклатура.ОграничениеТипа = НашеОписание;
	Запись.ЦеноваяГруппа_Номенклатура = НашеОписание.ПривестиЗначение(Запись.ЦеноваяГруппа_Номенклатура);
	Элементы.ГруппаДаты.Видимость=Запись.ТипЗаписи = 0;
    Элементы.Начало.Доступность=не значениезаполнено(Запись.Начало);
	
	
	
	
КонецПроцедуры

#КонецОбласти
